InjectionExpectedStub.json

{"id":"5e143eb7-8847-c43e-3eed-816e39cfc038","name":"Adil'sStub","protocol":"http","port":"7780","defaultResponse":{"statusCode":"404","headers":{"Content-Type":"application/json"},"body":{"error":"Not Found"}},"operations":{"4b8b43a6-9375-f8a6-6eb6-514a5c3e9781":{"name":"operationJSON","scenarios":{"7843d201-bf4c-5fd6-c6a9-8d1b88f1e1b9":{"name":"scenarioXML","tag":"345","request":{"requestFrom":"::1:53926","method":"GET","path":"/customers/12345/advisors/678910","query":{"QUERY1":"QUERY1"},"form":{"QUERY1":"QUERY1"},"headers":{"Content-Type":"application/xml","Host":"localhost:7780","Connection":"keep-alive","Cache-Control":"no-cache","User-Agent":"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/64.0.3282.140 Safari/537.36","Postman-Token":"79ba9ef8-9f83-e313-2735-ed9ac8d09ddf","Accept":"*/*","Accept-Encoding":"gzip, deflate, br","Accept-Language":"en-US,en;q=0.9"},"body":"<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' xmlns:cli='http://www.sonatacentral.com/service/v30/common/client' xmlns:ser='http://www.sonatacentral.com/service/v30/Service' xmlns:cal='http://www.sonatacentral.com/service/v30/CallerDetails' xmlns:iden='http://www.sonatacentral.com/service/v30/globaltypes/IdentifierType' xmlns:cli1='http://www.sonatacentral.com/service/v30/globaltypes/common/client/ClientGroupType' xmlns:dat='http://www.sonatacentral.com/service/v30/globaltypes/common/data/DataGroupType'>   <soapenv:Header/>   <soapenv:Body>      <cli:getAccountListRequest>         <ser:CallerDetails>            <cal:username>demo</cal:username>            <cal:country>uk</cal:country>            <cal:language>en</cal:language>            <cal:databaseIdentifier>SonataDatasource</cal:databaseIdentifier>         </ser:CallerDetails>         <cli:client>            <!--Optional:-->            <iden:id>SR4 7HA</iden:id>         </cli:client>         <!--Zero or more repetitions:-->         <!--Optional:-->         <cli:includeClientAccountRelationship all='?'>all</cli:includeClientAccountRelationship>         <!--Optional:-->         <cli:includeAdvisorGroup>true</cli:includeAdvisorGroup>         <!--Optional:-->         <cli:includeProduct>true</cli:includeProduct>         <!--Optional:-->         <cli:includeRegularContributionPlan>true</cli:includeRegularContributionPlan>         <!--Optional:-->         <cli:includeMarketingCampaign>true</cli:includeMarketingCampaign>         <!--Optional:-->         <cli:includeEmployer>true</cli:includeEmployer>         <!--Optional:-->         <cli:includeExternalReference>true</cli:includeExternalReference>         <!--Optional:-->         <cli:includeGenericVariable>true</cli:includeGenericVariable>         <!--Optional:-->         <cli:includeSuperDetailsWithoutExp>true</cli:includeSuperDetailsWithoutExp>         <!--Optional:-->         <cli:includeSuperDetails>true</cli:includeSuperDetails>         <!--Optional:-->         <cli:includeSchemeCategory>true</cli:includeSchemeCategory>         <!--Optional:-->         <cli:includeLatestActivity>true</cli:includeLatestActivity>         <!--Optional:-->         <cli:includeCashAndStockBalance>true</cli:includeCashAndStockBalance>         <!--Optional:-->        </cli:getAccountListRequest>   </soapenv:Body></soapenv:Envelope>"},"response":{"statusCode":"200","headers":{"Content-Type":"application/xml"},"body":"<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' xmlns:cli='http://www.sonatacentral.com/service/v30/common/client' xmlns:ser='http://www.sonatacentral.com/service/v30/Service' xmlns:cal='http://www.sonatacentral.com/service/v30/CallerDetails' xmlns:iden='http://www.sonatacentral.com/service/v30/globaltypes/IdentifierType' xmlns:cli1='http://www.sonatacentral.com/service/v30/globaltypes/common/client/ClientGroupType' xmlns:dat='http://www.sonatacentral.com/service/v30/globaltypes/common/data/DataGroupType'>   <soapenv:Header/>   <soapenv:Body>      <cli:getAccountListRequest>         <ser:CallerDetails>            <cal:username>demo</cal:username>            <cal:country>uk</cal:country>            <cal:language>en</cal:language>            <cal:databaseIdentifier>SonataDatasource</cal:databaseIdentifier>         </ser:CallerDetails>         <cli:client>            <!--Optional:-->            <iden:id>SR4 7HA</iden:id>         </cli:client>         <!--Zero or more repetitions:-->         <!--Optional:-->         <cli:includeClientAccountRelationship all='?'>all</cli:includeClientAccountRelationship>         <!--Optional:-->         <cli:includeAdvisorGroup>true</cli:includeAdvisorGroup>         <!--Optional:-->         <cli:includeProduct>true</cli:includeProduct>         <!--Optional:-->         <cli:includeRegularContributionPlan>true</cli:includeRegularContributionPlan>         <!--Optional:-->         <cli:includeMarketingCampaign>true</cli:includeMarketingCampaign>         <!--Optional:-->         <cli:includeEmployer>true</cli:includeEmployer>         <!--Optional:-->         <cli:includeExternalReference>true</cli:includeExternalReference>         <!--Optional:-->         <cli:includeGenericVariable>true</cli:includeGenericVariable>         <!--Optional:-->         <cli:includeSuperDetailsWithoutExp>true</cli:includeSuperDetailsWithoutExp>         <!--Optional:-->         <cli:includeSuperDetails>true</cli:includeSuperDetails>         <!--Optional:-->         <cli:includeSchemeCategory>true</cli:includeSchemeCategory>         <!--Optional:-->         <cli:includeLatestActivity>true</cli:includeLatestActivity>         <!--Optional:-->         <cli:includeCashAndStockBalance>true</cli:includeCashAndStockBalance>         <!--Optional:-->        </cli:getAccountListRequest>   </soapenv:Body></soapenv:Envelope>"},"parameters":[{"key":"QUERY1","in":"query","comparator":"==","val":"QUERY1"},{"key":"QUERY1","in":"form","comparator":"==","val":"QUERY1"},{"key":"Content-Type","in":"headers","comparator":"==","val":"application/xml"},{"key":"METHOD","in":"method","comparator":"==","val":"GET"},{"key":"/soapenv:Envelope/soapenv:Body/cli:getAccountListRequest/cli:client/iden:id","in":"body","comparator":"==","val":"sr4 7ha"},{"key":"customer","in":"path","comparator":"==","val":"12345"},{"key":"/royallondon/advisors","in":"completePath","comparator":"contains","val":"/advisors"}]},"929becb8-3e74-6c2b-cee4-2a37e6873a4e":{"name":"scenarioJSON","tag":"123","request":{"requestFrom":"::1:53926","method":"GET","path":"/customers/12345/advisors/678910","query":{"QUERY1":"QUERY1"},"form":{"QUERY1":"QUERY1"},"headers":{"Content-Type":"application/json","Host":"localhost:7780","Connection":"keep-alive","Cache-Control":"no-cache","User-Agent":"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/64.0.3282.140 Safari/537.36","Postman-Token":"79ba9ef8-9f83-e313-2735-ed9ac8d09ddf","Accept":"*/*","Accept-Encoding":"gzip, deflate, br","Accept-Language":"en-US,en;q=0.9"},"body":"{  \"firstName\": \"John\",  \"lastName\" : \"doe\",  \"age\"      : 26,  \"address\"  : {    \"streetAddress\": \"naist street\",    \"city\"         : \"Nara\",    \"postalCode\"   : \"sr4 7ha\"  },  \"phoneNumbers\": [    {      \"type\"  : \"iPhone\",      \"number\": \"0123-4567-8888\"    },    {      \"type\"  : \"home\",      \"number\": \"0123-4567-8910\"    }  ]}"},"response":{"statusCode":"200","headers":{"Content-Type":"application/json"},"body":"{  \"firstName\": \"John\",  \"lastName\" : \"doe\",  \"age\"      : 26,  \"address\"  : {    \"streetAddress\": \"naist street\",    \"city\"         : \"Nara\",    \"postalCode\"   : \"sr4 7ha\"  },  \"phoneNumbers\": [    {      \"type\"  : \"iPhone\",      \"number\": \"0123-4567-8888\"    },    {      \"type\"  : \"home\",      \"number\": \"0123-4567-8910\"    }  ]}"},"parameters":[{"key":"QUERY1","in":"query","comparator":"==","val":"QUERY1"},{"key":"QUERY1","in":"form","comparator":"==","val":"QUERY1"},{"key":"Content-Type","in":"headers","comparator":"==","val":"application/json"},{"key":"METHOD","in":"method","comparator":"==","val":"GET"},{"key":"$.address.postalCode","in":"body","comparator":"==","val":"sr4 7ha"},{"key":"customer","in":"path","comparator":"==","val":"12345"},{"key":"/royallondon/advisors","in":"completePath","comparator":"contains","val":"/advisors"}]}},"response":{"statusCode":"200","headers":{"Content-Type":"application/json"},"body":"{'operationResponseJSON':'triggred'}"},"parameters":[{"key":"QUERY1","in":"query","comparator":"==","val":"QUERY1"},{"key":"QUERY1","in":"form","comparator":"==","val":"QUERY1"},{"key":"Content-Type","in":"headers","comparator":"==","val":"application/json"},{"key":"METHOD","in":"method","comparator":"==","val":"GET"},{"key":"$.address.postalCode","in":"body","comparator":"==","val":"sr4 7ha"},{"key":"customer","in":"path","comparator":"==","val":"12345"},{"key":"/royallondon/advisors","in":"completePath","comparator":"contains","val":"/advisors"}]},"e9d32e35-fb42-7654-23b0-6fd65c1492c2":{"name":"operationXML","scenarios":{"7843d201-bf4c-5fd6-c6a9-8d1b88f1e1b9":{"name":"scenarioXML","tag":"345","request":{"requestFrom":"::1:53926","method":"GET","path":"/customers/12345/advisors/678910","query":{"QUERY1":"QUERY1"},"form":{"QUERY1":"QUERY1"},"headers":{"Content-Type":"application/xml","Host":"localhost:7780","Connection":"keep-alive","Cache-Control":"no-cache","User-Agent":"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/64.0.3282.140 Safari/537.36","Postman-Token":"79ba9ef8-9f83-e313-2735-ed9ac8d09ddf","Accept":"*/*","Accept-Encoding":"gzip, deflate, br","Accept-Language":"en-US,en;q=0.9"},"body":"<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' xmlns:cli='http://www.sonatacentral.com/service/v30/common/client' xmlns:ser='http://www.sonatacentral.com/service/v30/Service' xmlns:cal='http://www.sonatacentral.com/service/v30/CallerDetails' xmlns:iden='http://www.sonatacentral.com/service/v30/globaltypes/IdentifierType' xmlns:cli1='http://www.sonatacentral.com/service/v30/globaltypes/common/client/ClientGroupType' xmlns:dat='http://www.sonatacentral.com/service/v30/globaltypes/common/data/DataGroupType'>   <soapenv:Header/>   <soapenv:Body>      <cli:getAccountListRequest>         <ser:CallerDetails>            <cal:username>demo</cal:username>            <cal:country>uk</cal:country>            <cal:language>en</cal:language>            <cal:databaseIdentifier>SonataDatasource</cal:databaseIdentifier>         </ser:CallerDetails>         <cli:client>            <!--Optional:-->            <iden:id>SR4 7HA</iden:id>         </cli:client>         <!--Zero or more repetitions:-->         <!--Optional:-->         <cli:includeClientAccountRelationship all='?'>all</cli:includeClientAccountRelationship>         <!--Optional:-->         <cli:includeAdvisorGroup>true</cli:includeAdvisorGroup>         <!--Optional:-->         <cli:includeProduct>true</cli:includeProduct>         <!--Optional:-->         <cli:includeRegularContributionPlan>true</cli:includeRegularContributionPlan>         <!--Optional:-->         <cli:includeMarketingCampaign>true</cli:includeMarketingCampaign>         <!--Optional:-->         <cli:includeEmployer>true</cli:includeEmployer>         <!--Optional:-->         <cli:includeExternalReference>true</cli:includeExternalReference>         <!--Optional:-->         <cli:includeGenericVariable>true</cli:includeGenericVariable>         <!--Optional:-->         <cli:includeSuperDetailsWithoutExp>true</cli:includeSuperDetailsWithoutExp>         <!--Optional:-->         <cli:includeSuperDetails>true</cli:includeSuperDetails>         <!--Optional:-->         <cli:includeSchemeCategory>true</cli:includeSchemeCategory>         <!--Optional:-->         <cli:includeLatestActivity>true</cli:includeLatestActivity>         <!--Optional:-->         <cli:includeCashAndStockBalance>true</cli:includeCashAndStockBalance>         <!--Optional:-->        </cli:getAccountListRequest>   </soapenv:Body></soapenv:Envelope>"},"response":{"statusCode":"200","headers":{"Content-Type":"application/xml"},"body":"<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' xmlns:cli='http://www.sonatacentral.com/service/v30/common/client' xmlns:ser='http://www.sonatacentral.com/service/v30/Service' xmlns:cal='http://www.sonatacentral.com/service/v30/CallerDetails' xmlns:iden='http://www.sonatacentral.com/service/v30/globaltypes/IdentifierType' xmlns:cli1='http://www.sonatacentral.com/service/v30/globaltypes/common/client/ClientGroupType' xmlns:dat='http://www.sonatacentral.com/service/v30/globaltypes/common/data/DataGroupType'>   <soapenv:Header/>   <soapenv:Body>      <cli:getAccountListRequest>         <ser:CallerDetails>            <cal:username>demo</cal:username>            <cal:country>uk</cal:country>            <cal:language>en</cal:language>            <cal:databaseIdentifier>SonataDatasource</cal:databaseIdentifier>         </ser:CallerDetails>         <cli:client>            <!--Optional:-->            <iden:id>SR4 7HA</iden:id>         </cli:client>         <!--Zero or more repetitions:-->         <!--Optional:-->         <cli:includeClientAccountRelationship all='?'>all</cli:includeClientAccountRelationship>         <!--Optional:-->         <cli:includeAdvisorGroup>true</cli:includeAdvisorGroup>         <!--Optional:-->         <cli:includeProduct>true</cli:includeProduct>         <!--Optional:-->         <cli:includeRegularContributionPlan>true</cli:includeRegularContributionPlan>         <!--Optional:-->         <cli:includeMarketingCampaign>true</cli:includeMarketingCampaign>         <!--Optional:-->         <cli:includeEmployer>true</cli:includeEmployer>         <!--Optional:-->         <cli:includeExternalReference>true</cli:includeExternalReference>         <!--Optional:-->         <cli:includeGenericVariable>true</cli:includeGenericVariable>         <!--Optional:-->         <cli:includeSuperDetailsWithoutExp>true</cli:includeSuperDetailsWithoutExp>         <!--Optional:-->         <cli:includeSuperDetails>true</cli:includeSuperDetails>         <!--Optional:-->         <cli:includeSchemeCategory>true</cli:includeSchemeCategory>         <!--Optional:-->         <cli:includeLatestActivity>true</cli:includeLatestActivity>         <!--Optional:-->         <cli:includeCashAndStockBalance>true</cli:includeCashAndStockBalance>         <!--Optional:-->        </cli:getAccountListRequest>   </soapenv:Body></soapenv:Envelope>"},"parameters":[{"key":"QUERY1","in":"query","comparator":"==","val":"QUERY1"},{"key":"QUERY1","in":"form","comparator":"==","val":"QUERY1"},{"key":"Content-Type","in":"headers","comparator":"==","val":"application/xml"},{"key":"METHOD","in":"method","comparator":"==","val":"GET"},{"key":"/soapenv:Envelope/soapenv:Body/cli:getAccountListRequest/cli:client/iden:id","in":"body","comparator":"==","val":"sr4 7ha"},{"key":"customer","in":"path","comparator":"==","val":"12345"},{"key":"/royallondon/advisors","in":"completePath","comparator":"contains","val":"/advisors"}]},"929becb8-3e74-6c2b-cee4-2a37e6873a4e":{"name":"scenarioJSON","tag":"123","request":{"requestFrom":"::1:53926","method":"GET","path":"/customers/12345/advisors/678910","query":{"QUERY1":"QUERY1"},"form":{"QUERY1":"QUERY1"},"headers":{"Content-Type":"application/json","Host":"localhost:7780","Connection":"keep-alive","Cache-Control":"no-cache","User-Agent":"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/64.0.3282.140 Safari/537.36","Postman-Token":"79ba9ef8-9f83-e313-2735-ed9ac8d09ddf","Accept":"*/*","Accept-Encoding":"gzip, deflate, br","Accept-Language":"en-US,en;q=0.9"},"body":"{  \"firstName\": \"John\",  \"lastName\" : \"doe\",  \"age\"      : 26,  \"address\"  : {    \"streetAddress\": \"naist street\",    \"city\"         : \"Nara\",    \"postalCode\"   : \"sr4 7ha\"  },  \"phoneNumbers\": [    {      \"type\"  : \"iPhone\",      \"number\": \"0123-4567-8888\"    },    {      \"type\"  : \"home\",      \"number\": \"0123-4567-8910\"    }  ]}"},"response":{"statusCode":"200","headers":{"Content-Type":"application/json"},"body":"{  \"firstName\": \"John\",  \"lastName\" : \"doe\",  \"age\"      : 26,  \"address\"  : {    \"streetAddress\": \"naist street\",    \"city\"         : \"Nara\",    \"postalCode\"   : \"sr4 7ha\"  },  \"phoneNumbers\": [    {      \"type\"  : \"iPhone\",      \"number\": \"0123-4567-8888\"    },    {      \"type\"  : \"home\",      \"number\": \"0123-4567-8910\"    }  ]}"},"parameters":[{"key":"QUERY1","in":"query","comparator":"==","val":"QUERY1"},{"key":"QUERY1","in":"form","comparator":"==","val":"QUERY1"},{"key":"Content-Type","in":"headers","comparator":"==","val":"application/json"},{"key":"METHOD","in":"method","comparator":"==","val":"GET"},{"key":"$.address.postalCode","in":"body","comparator":"==","val":"sr4 7ha"},{"key":"customer","in":"path","comparator":"==","val":"12345"},{"key":"/royallondon/advisors","in":"completePath","comparator":"contains","val":"/advisors"}]}},"response":{"statusCode":"200","headers":{"Content-Type":"application/xml"},"body":"<operations><operationResponseJSON></operationResponseJSON></operations>"},"parameters":[{"key":"METHOD","in":"method","comparator":"==","val":"POST"},{"key":"path","in":"completePath","comparator":"==","val":"/customers/12345/advisors/678910"}]}},"stubs":[]}